package gr.aueb.cf.ch7;

public class ImmutableStr {

    public static void main(String[] args) {

        String s1 = "Coding"; // Δημιουργείται μία συμβολοσειρά "Coding" και η s1 δείχνει σε αυτήν.
        String s2 = "Coding"; // Η s2 δείχνει στην ίδια συμβολοσειρά "Coding".

        s1 = "Factory"; // Δημιουργείται μια νέα συμβολοσειρά "Factory" στη μνήμη και η s1 δείχνει σε αυτήν.
        s2 = "Athens";  // Δημιουργείται μια νέα συμβολοσειρά "Athens" και η s2 δείχνει σε αυτήν.
        /**
         * Η "Coding" παραμένει όπως είναι στη μνήμη: Όταν η s1 παίρνει την τιμή "Factory", η "Coding"
         * παραμένει αναλλοίωτη (δεν αλλάζει η ίδια). Απλά, η μεταβλητή s1 σταματά να δείχνει στη "Coding"
         * και δείχνει στη "Factory".
         * Κάθε νέα τιμή δημιουργεί μια νέα συμβολοσειρά:
         * Η "Factory" και η "Athens" δημιουργούνται ως νέες συμβολοσειρές στη μνήμη,
         * χωρίς να τροποποιούνται οι παλιές τιμές.
         * Χρησιμοποίησε τη StringBuilder ή τη StringBuffer,
         * οι οποίες είναι μεταβλητές και επιτρέπουν την αλλαγή των χαρακτήρων χωρίς να δημιουργούν
         * νέες συμβολοσειρές.
         */
        System.out.println(s1);
    }
}
